#+title: Curso de Python: Nivel Inicial
#+author: Daniel Molina Cabrera
#+date: Curso de Python (Abril 2018)
#+latex_class: beamer
#+LaTeX_CLASS_OPTIONS: [bigger,unknownkeysallowed]
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \lstset{escapeinside={'}{'},basicstyle=\scriptsize\ttfamily,showspace=false}
#+BEAMER_THEME: ucadoc
#+options: H:2 ^:nil toc:nil
#+SELECT_TAGS: available
#+EXCLUDE_TAGS: noexport
#+LaTeX: \AtBeginSection[]{ \begin{frame}{Índice}     \tableofcontents[currentsection]     \end{frame} }
#+PROPERTY: header-args :eval never-export
*** 

#+name: hello
#+BEGIN_SRC python :results output :export both
msg = "Hola a todos"
print(msg)
#+END_SRC
#+RESULTS: hello
: Hola a todos

#+RESULTS:
: Hola a todos

*** ¿Y si necesito recorrer varias listas a la vez?          :B_exampleblock:
    :PROPERTIES:
    :BEAMER_env: exampleblock
    :END:

#+NAME: zip
#+BEGIN_SRC python :results output :exports code :session ses
  nombres = ['Daniel', 'Amalia', 'Carlos', 'Rosa']
  pies = [43, 41, 44, 42]

  # Option 1: estilo C
  for i in range(len(nombres)):
      print("Usuario", nombres[i], "tiene pie", pies[i])
  # Option 2: Recorrido con enumerate
  for i, nombre in enumerate(nombres):
      print("Usuario", nombre, "tiene pie", pies[i])
  # Option 3: uso de zip
  for nombre, pie in zip(nombres, pies):
      print("Usuario", nombre, "tiene pie", pie)
#+END_SRC
#+RESULTS: zip
#+begin_example
Usuario Daniel tiene pie 43
Usuario Amalia tiene pie 41
Usuario Carlos tiene pie 44
Usuario Rosa tiene pie 42
Usuario Daniel tiene pie 43
Usuario Amalia tiene pie 41
Usuario Carlos tiene pie 44
Usuario Rosa tiene pie 42
Usuario Daniel tiene pie 43
Usuario Amalia tiene pie 41
Usuario Carlos tiene pie 44
Usuario Rosa tiene pie 42
#+end_example
